package lesson_3.homework;

// Напишите функцию analyzeNumbers, которая принимает на вход целочисленный список arr и:
//Сортирует его по возрастанию и выводит на экран
//Находит минимальное значение в списке и выводит на экран - Minimum is {число}
//Находит максимальное значение в списке и выводит на экран - Maximum is {число}
//Находит среднее арифметическое значений списка и выводит на экран - Average is =  {число}
//Напишите свой код в методе analyzeNumbers класса Answer. Метод analyzeNumbers принимает на вход один параметр:
//Integer[] arr - список целых чисел
//Пример
//arr = new Integer[]{4, 2, 7, 5, 1, 3, 8, 6, 9};
//analyzeNumbers(arr)
//// [1, 2, 3, 4, 5, 6, 7, 8, 9]
//// Minimum is 1
//// Maximum is 9
//// Average is = 5

public class Hw_1original {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }


}
