package lesson_1.homework;

// В файле задано уравнение вида q + w = e (q, w, e >= 0).
// Некоторые цифры могут быть заменены знаком вопроса, например 2? + ?5 = 69.
// Восстановите выражение до верного равенства.
// Предложите хотя бы одно решение или сообщите, что его нет.
// Напишите класс Equation, содержащий метод getSolution,
// который будет считывать уравнение из файла и восстановит его до верного равенства.
// Выведите сначала строку формата "Given the equation: {выражение из файла}".
// А затем верните строку формата "Result: {цельное выражение}".
// Если выражение не имеет решений - верните строку "No solution".
// Пример:
// Given the equation: ? + 4 = 9
// Result: 5 + 4 = 9

public class Hw_4 {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}
