package lesson_1.seminar;

// Ввод данных с помощью консоли:
// За чтение данных отвечает объект out в классе java.lang.System
// • print(): вывод переданной информации.
// • println(): вывод переданной информации и перевод строки.
// • printf(): форматированный вывод
// За чтение данных отвечает класс java.util.Scanner

public class Ex001 {
    public static void main(String[] args) {
//         int i = 2;
//         long l;
//         float f;
//         double d;
//         byte b;
//         short s;
//         char ch = 'w';
//         boolean bl;
//         int[] ints = new int[10];
//         int[] ints1 = new int[]{1, 2, 3, 4};
//         int[] ints2 = {1, 2, 3};
//         int[] tmp = new int[ints.length+1];
//         for (int k = 0; k < 10; k++) {
//
//         } for (int j = 0; j < ints.length; j++) {
//             ints[j] = new Random().nextInt(200);
//             tmp[j] = ints[j];
//         }
//             ints = tmp;
//             ints[ints.length-1] = 1000;
//             System.out.println(Arrays.toString(ints));
//             String s1 = "Привет Мир!";
//             s1 += "?";
//             System.out.println(s1.replace("р", ""));
//             s1 = s1.replace("Пр", "о");
    }
}

// Задание №0. Настроим VS Code или IntelliJ IDEA
// Скачать и установить:
// - Visual Studio Code - Mac, Linux, Windows: https://code.visualstudio.com/download
// - Install IntelliJ IDEA Community Edition: https://www.jetbrains.com/idea/download/?section=windows
// - Настроить проект, вывести в консоль “Hello world!”.
// - Вывести в консоль системные дату и время.



